app/views/comments/show.html.erb

  <br>
  <h2 style="color:  #f1f1f1"><%= "#{Reply.where(comment_id: @comment.id).count} #{(Reply.where(comment_id: @comment.id).count > 1) ? "réponses" : "réponse"}" %></h2>
---
SELECT "replies".* FROM "replies" WHERE "replies"."comment_id" = $1  [["comment_id", 2]]
SELECT COUNT(*) FROM "replies" WHERE "replies"."comment_id" = $1  [["comment_id", 2]]

            <br>
            <span style="padding-left: 20px" class="fas fa-thumbs-up"></span> <%= Like.where(reply_id: reply.id).count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."reply_id" = $1  [["reply_id", 1]]