app/views/gossips/index.html.erb

          <br>
          <span class="fas fa-comments"></span> <%= Comment.where(gossip_id: gossip.id).count %>
          <span style="padding-left: 20px" class="fas fa-thumbs-up"></span> <%= Like.where(gossip_id: gossip.id).count %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 13]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 2]]