app/views/gossips/list_gossips.html.erb

SELECT "gossips".* FROM "gossips"
---
  <br>
  <% for gossip in Gossip.all %>