app/views/gossips/show.html.erb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 3]]
---
  <br>
  <h2 style="color:  #f1f1f1"><%= "#{Comment.where(gossip_id: @gossip.id).count} #{(Comment.where(gossip_id: @gossip.id).count > 1) ? "commentaires" : "commentaire"}" %></h2>

SELECT COUNT(*) FROM "replies" WHERE "replies"."comment_id" = $1  [["comment_id", 3]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."comment_id" = $1  [["comment_id", 3]]
---
            <br>
            <span class="fas fa-comment-dots"></span> <%= Reply.where(comment_id: comment.id).count %>
            <span style="padding-left: 20px" class="fas fa-thumbs-up"></span> <%= Like.where(comment_id: comment.id).count %>