app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."comment_id" = $1  [["comment_id", 2]]
---
  def show
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.find(params[:id])
    @replies = Reply.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Gossip.find(params[:gossip_id]).comments.new

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:gossip_id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "Youpi un commentaire yee"], ["updated_at", "2018-10-31 21:55:22.981922"], ["id", 2]]
INSERT INTO "comments" ("anonymous_commentator", "content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["anonymous_commentator", "commentaire de pute"], ["content", "lol"], ["user_id", 2], ["gossip_id", 3], ["created_at", "2018-11-02 04:22:07.921191"], ["updated_at", "2018-11-02 04:22:07.921191"]]
---
  def create
    @comment = Gossip.find(params[:gossip_id]).comments.new(comment_params)

    respond_to do |format|
      if @comment.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "prout mdrd jpp ptn"], ["updated_at", "2018-11-02 04:46:05.480172"], ["id", 2]]
---
  def update
    @gossip = Gossip.find(params[:gossip_id])

    respond_to do |format|
      if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
---
  def destroy
    respond_to do |format|
      gossip_id = @comment.gossip_id
      if @comment.destroy