app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 2]]
---
  def show
    @gossip = Gossip.find(params[:id])
    @comments = Comment.all

INSERT INTO "gossips" ("anonymous_author", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["anonymous_author", "Jean-Pute"], ["content", "salope"], ["user_id", 2], ["created_at", "2018-11-01 19:43:58.661045"], ["updated_at", "2018-11-01 19:43:58.661045"]]
---
  def create
    print params
    @gossip = Gossip.new(gossip_params)

    respond_to do |format|
      if @gossip.save

UPDATE "gossips" SET "anonymous_author" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["anonymous_author", "Jean-Paul"], ["content", "A la street je suis fiancé"], ["updated_at", "2018-11-02 02:48:32.456270"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @gossip.update(gossip_params)

DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 1]]
---
  def destroy
    respond_to do |format|
      if @gossip.destroy

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_gossip
      @gossip = Gossip.find(params[:id])