app/controllers/likes_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    @like = Gossip.find(params[:gossip_id]).likes.new(gossip_id: params[:gossip_id], user_id: session[:user_id])