app/controllers/replies_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.find(params[:comment_id])
    @reply = Comment.find(params[:comment_id]).replies.new

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.find(params[:comment_id])
    @reply = Reply.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "replies" ("anonymous_replier", "content", "comment_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    print params
    @reply = Comment.find(params[:comment_id]).replies.new(reply_params)

    respond_to do |format|
      if @reply.save

UPDATE "replies" SET "content" = $1, "updated_at" = $2 WHERE "replies"."id" = $3  [["content", "Je rage parce que moi ça marche pas :("], ["updated_at", "2018-11-02 01:34:26.297003"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @reply.update(reply_params)

DELETE FROM "replies" WHERE "replies"."id" = $1  [["id", 2]]
---
  def destroy
    respond_to do |format|
      comment_id = @reply.comment_id
      if @reply.destroy

SELECT  "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_reply
      @reply = Reply.find(params[:id])